uestcxu2019/MSP430FR2433_CC1101_REG/main.c
/**************************************************************************************************
*************************************Copyright(c)**************************************************
***************************************************************************************************/


/****************************************************************************************************
 *
 *		Author	: xuzhi Liu
 *		Breif	: MSP43FR2433与CC1101/CC115L SPI无线通信,此代码为发送端代码
 *		Date	: 2019.03.29
 *
 *		  History
 *
 *				1.Author : xuzhi Liu
 *				  Date	 : 2019.03.29
 *				  Mode	 : 1.从MSP430FR6989开发板上移植代码到MPS430FR2433
 *								使用EUSCI_B0_SPI接口通信
 *
 *						   2.硬件连接说明:
 *							  *****************************
 *							  *   SPI_CS     -->  P1.0    *
 *							  *							  *
 *							  *   SPI_CLK    -->  P1.1    *
 *							  *							  *
 *							  *   SPI_MOSI   -->  P1.2    *
 *							  *						      *
 *							  *   SPI_MISO   -->  P1.3    *
 *							  *							  *
 *							  *****************************
 *
 *
 *				2.Author : xuzhi Liu
 *				  Date	 : 2019.04.24
 *				  Mode	 : 1.添加用户数据掉电不丢失，存储,效果:第一次按下开灯，再次按下关灯
 *
 *						    说明:对内部FRAM数据存储掉电数据存储操作方式(针对FR2433)
 *						      MSP430FR2433型号对内部FRAM存储操作有写保护功能,因此
 *							   使用指针对某一特定地址进行读写需要先解锁FRAM写保护,然后
 *							   对用户数据存储区或代码存储区进行写保护解锁,详情见User GUIDE P45
 *
 *						 	  经测试发现,对FRAM写保护及代码存储区和数据存储区(存在信息段)操作时，必须
 *						 	  采用字的方式操作，否则不起作用
 *
 *				  		   2.移植黄师兄能量管理代码
 *
 *
 *				3.Author : xuzhi Liu
 *				  Date	 : 2019.04.26
 *				  Mode	 : 1.添加地址唯一ID识别，发送和接收端必须地址相对于才能收到数据
 *				  		      其中,地址编号在bsp_cc1101.h文件开头宏定义处
 *				  		   2.注释掉能量管理代码
 *
 *
 *				4.Author : xuzhi Liu
 *				  Date	 : 2019.05.16
 *				  Mod	 : 在每段代码中通过识别P2.2引脚(利用示波器测量)可以清楚知道每段运行时间
 *
 *
 *
 *				5.Author : xuzhi Liu
 *				  Date	 : 2019.05.28
 *				  Mod	 : 添加uart接口，用于测试发送数据,使用UCA0_UART
 *				  			硬件连接:
 *				  					UCA0TXD --> P1.4
 *				  					UCA0RXD --> P1.5
 *
 *
 *				 6.Author : xuzhi Liu
 *				   Date	  : 2019.06.06
 *				   Mod	   : 关闭uart，添加100kbaud的数据传输，在cc101_init中,通过条件编译宏可修改
 *				   		  默认采用250kbaud速率
 *
 *
 *				 7.Author : xuzhi Liu
 *				   Date	  : 2019.07.12
 *				   Mode   : 添加放电电路(需要整流电路与能量管理电路)P3.2与NMos管连接
 *
 *
 *				 8.Author : xuzhi Liu
 *				   Date	  : 2019.07.19
 *				   Mode   : 修改SMCLK时钟为4MHz
 *
 ****************************************************************************************************/

#include "msp430fr2433.h"
#include "bsp_spi.h"
#include "bsp_cc1101.h"
#include "bsp_led.h"
#include "bsp_delay.h"
//#include "bsp_uart.h"
#include "bsp_cs.h"


#define FRAM_ADDR 0x1800		//信息存储段地址，用于保存掉电数据

#define DATA_FRAM_WRITE_ENABLE	0xA501			//信息存储区写使能宏定义
#define DATA_FRAM_WRITE_DISABLE 0xA503			//信息存储区写保护宏定义



int main(void)
{
/*************************************************************************************
 *	变量定义
*************************************************************************************/
	//定义用于发送数据数组
	uint8_t Tx_ON[]={0x59,0xBB,0x32};   	//定义要发送的数据，用于开灯指令
	uint8_t Tx_OFF[]={0x59,0xAA,0x35};   	//定义要发送的数据，用于关灯指令
//	uint8_t Tx_data[]= {0x59,0xDD,0x30};	//用于测试闪灯
	uint8_t *fram;							//用于读取特定地址的数据的指针(保存数据掉电不丢失)


/*************************************************************************************/
	WDTCTL = WDTPW | WDTHOLD;	// Stop watchdog timer
	GPIO_LP_Init();				//GPIO低功耗引脚初始化
	PM5CTL0 &= ~LOCKLPM5;		//关闭高阻态
	CS_Init();					//时钟配置

/*************************************************************************************/
	SYSCFG0 =  DATA_FRAM_WRITE_ENABLE;	//解除FRAM写保护及信息存储段写保护
	fram = (uint8_t *)FRAM_ADDR;

	//用于初次判定,即未向此地址写入任何数据
	if(*fram == 0xFF)
	{
		*fram = 0xAA;
		SYSCFG0 =  DATA_FRAM_WRITE_DISABLE;	//锁定信息存储段写保护,即不能写入
	}

/*************************************************************************************/
	SYSCFG0 =  DATA_FRAM_WRITE_DISABLE;	//写保护使能


	SPI_Init();					//SPI初始化
	CC1101_Reset();
	Delay_us(45);				//复位后至少有40us的延时
	CC1101_Init();				//CC1101/CC115L有上电复位,因此此处只需要初始化即可

/*************************************************************************************/
 	switch (*fram)
	{
			case 0xAA:
				 SYSCFG0 =  DATA_FRAM_WRITE_ENABLE;		//解除FRAM写保护及信息存储段写保护
				 *fram = 0xBB;
				 CC1101_RFDataPack_Send(Tx_ON, sizeof(Tx_ON));	//发送指令
				 SYSCFG0 =  DATA_FRAM_WRITE_DISABLE;	//锁定信息存储段写保护,即不能写入
				 break;
			case 0xBB:
				 SYSCFG0 =  DATA_FRAM_WRITE_ENABLE;		//解除FRAM写保护及信息存储段写保护
				 *fram = 0xAA;
				 CC1101_RFDataPack_Send(Tx_OFF, sizeof(Tx_OFF));	//发送指令
				 SYSCFG0 =  DATA_FRAM_WRITE_DISABLE;	//锁定信息存储段写保护,即不能写入
				 break;
	}


/*******************************用于释放多余的能量************************************/
// 	P3OUT |= BIT2;
// 	Delay_ms(1);
 	while(1);
/* 	{
 		CC1101_RFDataPack_Send(Tx_data, sizeof(Tx_data));
 		Delay_ms(500);
 	}*/

/*************************************************************************************/
}
